import DataGrid from './DataGrid'

const TableFiltering = () => {
	return (
		<div>
			<div>
				Задача 2. Таблиця з фільтрацією та сортуванням, чутлива до UI
				<ul>
					<li>
						Створіть компонент DataGrid (батьківський) та GridRow (дочірній).
					</li>
					<li>
						DataGrid отримує великий масив даних, має поле вводу для фільтрації,
						кнопки для сортування за різними колонками.
					</li>
					<li>
						GridRow (обгорнутий у React.memo) відображає один рядок даних.
					</li>
					<li>
						Використайте useDeferredValue для пошукового запиту та/або
						параметрів сортування.
					</li>
					<li>
						Використайте useMemo для обчислення відфільтрованих та відсортованих
						даних на основі відкладених значень.
					</li>
					<li>
						Використайте useCallback для функцій-обробників сортування та інших
						інтерактивних елементів, які передаються до дочірніх компонентів.
					</li>
					<li>
						Мета: забезпечити швидкий відгук на введення та кліки, навіть якщо
						обробка даних займає час.
					</li>
				</ul>
			</div>
			<div>
				<DataGrid />
			</div>
		</div>
	)
}

export default TableFiltering
